<!-- add-pr-comment:add-pr-comment -->

data.archive_file.func1: Reading...
data.archive_file.func1: Read complete after 0s [id=95906ca2c7815c71ef36bbb78053c5b2a813bd5a]
data.aws_acm_certificate.namabanana: Reading...
data.aws_acm_certificate.namabanana: Read complete after 0s [id=arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9]
aws_cloudwatch_log_group.func1: Refreshing state... [id=/aws/lambda/send-mail-ses]
aws_cloudfront_function.index_document_function: Refreshing state... [id=index-document-function]
data.aws_iam_role.func1_role: Reading...
aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
aws_s3_bucket.send_mail_ses_src: Refreshing state... [id=send-mail-ses-src]
data.aws_iam_role.func1_role: Read complete after 0s [id=LambdaSESMailRole]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
aws_s3_object.func1: Refreshing state... [id=send-mail-ses.zip]
data.aws_iam_policy_document.policy_document: Reading...
data.aws_iam_policy_document.policy_document: Read complete after 0s [id=3292064385]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]
aws_lambda_function.func1: Refreshing state... [id=send-mail-ses]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_deployment.send_mail_api will be created
  + resource "aws_api_gateway_deployment" "send_mail_api" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "v1"
    }

  # aws_api_gateway_integration.send_mail_api_get will be created
  + resource "aws_api_gateway_integration" "send_mail_api_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:958933161565:function:send-mail-ses/invocations"
    }

  # aws_api_gateway_method.send_mail_api_get will be created
  + resource "aws_api_gateway_method" "send_mail_api_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.send_mail_api_resource will be created
  + resource "aws_api_gateway_resource" "send_mail_api_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "send"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.send_mail_api will be created
  + resource "aws_api_gateway_rest_api" "send_mail_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Send Mail API"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "SendMailAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration (known after apply)
    }

  # aws_lambda_function.func1 will be updated in-place
  ~ resource "aws_lambda_function" "func1" {
        id                             = "send-mail-ses"
        tags                           = {}
        # (30 unchanged attributes hidden)

      - environment {
          - variables = {
              - "EMAIL_FROM" = "frothybike8@gmailc.om"
              - "EMAIL_TO"   = "frothybike8@gmailc.om"
            } -> null
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "send-mail-ses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on apigateway.tf line 31, in resource "aws_api_gateway_deployment" "send_mail_api":
  31:     "aws_api_gateway_integration.send_mail_api_get",

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.send_mail_api,
  on apigateway.tf line 35, in resource "aws_api_gateway_deployment" "send_mail_api":
  35:   stage_name  = "v1"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
